{
  "backend/main.mo": "Main backend actor implementing note management (CRUD operations with self-destruct timers), user profiles, persistent recovery data storage, share links with encryption, blob storage mixins, and role-based access control using Internet Identity principals.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components including routing, note management, authentication, voice recording, share links, and Cyber-Tech themed UI components.",
  "frontend/index.html": "HTML entry point for the CypherSafe application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component managing TanStack Router with authenticated routes (notes, settings, story, guide) and public secure note view route (/s/$shareId), handling authentication flow with Internet Identity, splash screen, scanning animation, profile setup, and welcome popup states.",
  "frontend/src/components/DataOwnershipTerms.tsx": "Terms page component explaining data ownership (blockchain storage with zero access), voice data processing (local Web Speech API), and no-tracking policy with gold-themed Cyber-Tech styling and navigation back to settings.",
  "frontend/src/components/Footer.tsx": "Footer component displaying end-to-end encryption messaging, blockchain permanence notice, and copyright with Cyber-Tech neon styling.",
  "frontend/src/components/FullScreenEditorOverlay.tsx": "Full-screen note editor overlay with create/edit modes, voice-to-text transcription (Web Speech API with English/Hindi support), self-destruct timer selection, keyboard shortcuts (Ctrl+S to save, Escape to close), share dialog integration, and animated expand/collapse transitions from origin coordinates.",
  "frontend/src/components/Header.tsx": "Header component with logo, title, authentication button, and navigation menu (Our Story, Quick Guide, Settings) accessible via a sheet drawer when authenticated.",
  "frontend/src/components/InstallPrompt.tsx": "Desktop-only banner prompting users to install the PWA, with dismiss functionality that persists to localStorage and handles the beforeinstallprompt event.",
  "frontend/src/components/LockAnimation.tsx": "Loading screen displaying an animated lock cycling through 5 frames with pulsing glow effect and 'Securing your vault' message.",
  "frontend/src/components/LoginPrompt.tsx": "Pre-authentication landing card showcasing three security features (encryption, blockchain storage, zero knowledge) with a login button using Internet Identity.",
  "frontend/src/components/NewNoteOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/NoteEditor.tsx": "Empty file with no content.",
  "frontend/src/components/NotepadPage.tsx": "Empty file with no content.",
  "frontend/src/components/NotesApp.tsx": "Main notes dashboard managing search, note selection, full-screen editor overlay with animation origins, voice greeting, expired notes cleanup, and keyboard shortcuts (Ctrl+N, Escape).",
  "frontend/src/components/NotesList.tsx": "Scrollable list of notes sorted by last modified date, displaying title, timestamp, and self-destruct countdown with real-time updates every second.",
  "frontend/src/components/OurStory.tsx": "Static informational page explaining CypherSafe's mission of privacy-first blockchain storage with zero-knowledge architecture and a back navigation button.",
  "frontend/src/components/ProfileSetup.tsx": "First-time user onboarding form collecting the user's name and saving it to their profile with muteGreeting defaulted to false.",
  "frontend/src/components/QuickGuide.tsx": "Displays a static guide page with sections explaining secure authentication, note creation, blockchain saving, search/organization, and privacy features. Uses lucide-react icons and navigates back to the main notes page.",
  "frontend/src/components/ScanningAnimation.tsx": "Renders a full-screen scanning animation overlay with a \"SCANNING...\" message and animated scan line that fades out after 50ms. Used for visual transition effects.",
  "frontend/src/components/SecureNoteViewPage.tsx": "Displays a shared encrypted note by fetching encrypted data via share ID, extracting the decryption key from URL hash, and decrypting client-side. Handles errors for expired, invalid, or view-once links.",
  "frontend/src/components/Settings.tsx": "Settings page allowing users to toggle AI voice greeting on/off and navigate to data ownership terms. Fetches user profile and updates greeting preference via mutations.",
  "frontend/src/components/ShareLinkDialog.tsx": "Modal dialog for generating encrypted share links with options for view-once or timed expiry. Encrypts note content client-side, creates backend share link, and builds URL with decryption key in hash fragment.",
  "frontend/src/components/SplashScreen.tsx": "Displays a splash screen with the CypherSafe logo and \"Powered by Internet Computer\" text for 3 seconds, then zooms and fades out before calling onComplete callback.",
  "frontend/src/components/VaultLocked.tsx": "Full-screen locked vault UI prompting user to authenticate via Internet Identity. Shows animated glowing lock icon and unlock button with loading state.",
  "frontend/src/components/WelcomePopup.tsx": "Modal welcome dialog shown to new users, greeting them by name and explaining the private blockchain-encrypted nature of the vault. Marks popup as seen when closed.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "React hook that registers keyboard shortcuts (Ctrl+N for new note, Ctrl+S for save, Escape for exit) with authentication-aware behavior.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles and notes CRUD operations, including mutations with toast notifications and voice feedback integration.",
  "frontend/src/hooks/useVoiceGreeting.ts": "React hook that plays a time-based voice greeting with a soft chime using Web Speech API, selecting high-quality female voices and playing once per session unless muted.",
  "frontend/src/index.css": "Tailwind CSS configuration with a cyber-tech theme using OKLCH color system, defining neon blue/gold accents, glass morphism effects, and custom utility classes for glowing borders and text.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/shareCrypto.ts": "Client-side encryption utilities using Web Crypto API with AES-GCM for encrypting/decrypting note content, including base64 encoding helpers for key serialization.",
  "frontend/src/utils/shareLink.ts": "Utility function to construct share URLs with decryption keys embedded in the hash fragment for secure note sharing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color variables, custom fonts (Orbitron, Exo 2), sidebar/chart color schemes, border radius variables, and accordion animations.",
  "project_state.json": "Project state file for CypherSafe, a blockchain-based secure note-taking app with 12-word BIP39 mnemonic recovery, defining 12 pending feature requests for master key generation, premium Black & Gold UI vault cards, QR code scanning, and PDF export functionality."
}