{
  "backend/main.mo": "Main backend actor implementing note management (CRUD, self-destruct timers), user profiles, share links with encryption, blob storage, and role-based access control using ICP blockchain storage with Principal-based authentication.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including responsive side-by-side layout, keyboard shortcuts (Ctrl+N, Ctrl+S, Esc), desktop install prompt, and cross-device note sync via ICP blockchain with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including main app with TanStack Router, React Query hooks for backend operations, Cyber-Tech themed UI components (lock animation, header, footer, editors), voice recording with transcription, and responsive layouts.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div mounting React application titled 'CypherSafe Decentralized Private Vault'.",
  "frontend/src/App.tsx": "Root application component managing authentication flow with Internet Identity, routing between authenticated pages (notes, settings, guides) and public secure note view route (/s/$shareId), with splash screen, scanning animation, profile setup, and welcome popup orchestration.",
  "frontend/src/components/DataOwnershipTerms.tsx": "Terms page component with Cyber-Tech styling explaining data ownership (ICP blockchain storage), voice data privacy (local browser processing), no tracking policy, and liability disclaimer with back navigation to settings.",
  "frontend/src/components/Footer.tsx": "Footer component displaying end-to-end encryption messaging with lock icon, blockchain security statement, and CypherSafe copyright in Cyber-Tech theme with neon borders.",
  "frontend/src/components/FullScreenEditorOverlay.tsx": "Full-screen note editor component supporting create/edit modes with speech recognition (English/Hindi), auto-save, keyboard shortcuts, self-destruct timer, and share functionality with animated transitions.",
  "frontend/src/components/Header.tsx": "Application header with logo, authentication controls (Internet Identity login/logout), user profile display, and navigation menu (Our Story, Quick Guide, Settings) in a responsive sheet layout.",
  "frontend/src/components/InstallPrompt.tsx": "Desktop-only PWA install prompt banner that appears on screens wider than 1024px, handles beforeinstallprompt event, and persists dismissal state to localStorage.",
  "frontend/src/components/LockAnimation.tsx": "Loading screen component displaying an animated lock icon cycling through 5 frames at 400ms intervals with pulsing and neon glow effects.",
  "frontend/src/components/LoginPrompt.tsx": "Pre-authentication landing page showcasing CypherSafe features (encryption, blockchain storage, zero knowledge) with Internet Identity login button and feature cards.",
  "frontend/src/components/NewNoteOverlay.tsx": "Empty file with no content.",
  "frontend/src/components/NoteEditor.tsx": "Empty file with no content.",
  "frontend/src/components/NotepadPage.tsx": "Empty file with no content.",
  "frontend/src/components/NotesApp.tsx": "Main notes dashboard component managing note list display, search filtering, editor overlay state, voice greeting initialization, expired notes cleanup, and keyboard shortcuts (Ctrl+N for new note, Escape to close).",
  "frontend/src/components/NotesList.tsx": "Scrollable list component displaying notes sorted by last modified date with self-destruct countdown timers, selection state, loading skeletons, and empty state messaging.",
  "frontend/src/components/OurStory.tsx": "Displays the CypherSafe mission and story page with navigation back to notes, explaining the privacy-focused blockchain approach and zero-knowledge architecture.",
  "frontend/src/components/ProfileSetup.tsx": "First-time user onboarding component that prompts for name input and saves user profile with a form submission handler.",
  "frontend/src/components/QuickGuide.tsx": "Help page component displaying step-by-step instructions for using CypherSafe features including authentication, creating notes, saving, and searching.",
  "frontend/src/components/ScanningAnimation.tsx": "Full-screen overlay animation component showing a scanning effect with fade-out transition, used during authentication or loading states.",
  "frontend/src/components/SecureNoteViewPage.tsx": "Public page for viewing encrypted shared notes via link, handles decryption using URL hash key and displays error states for expired or invalid links.",
  "frontend/src/components/Settings.tsx": "Settings page with toggle for AI voice greeting preference and navigation to data ownership terms, using user profile queries.",
  "frontend/src/components/ShareLinkDialog.tsx": "Modal dialog for generating encrypted share links with options for view-once or timed expiry, handles client-side encryption and clipboard copying.",
  "frontend/src/components/SplashScreen.tsx": "Initial loading screen displaying CypherSafe logo with zoom-out animation and 'Powered by Internet Computer' branding before transitioning to main app.",
  "frontend/src/components/VaultLocked.tsx": "Displays a full-screen lock overlay with authentication button when the vault is locked. Shows loading state during login and supports WebAuthn devices.",
  "frontend/src/components/WelcomePopup.tsx": "Shows a welcome dialog to new users explaining the private, blockchain-encrypted nature of the vault. Marks the popup as seen when dismissed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking. Handles delegation identity validation and storage.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "Registers global keyboard shortcuts for Ctrl+N (new note), Ctrl+S (save), and Escape (exit editor) with authentication-aware enablement.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile and note CRUD operations, including welcome popup tracking, greeting preferences, and note self-destruct functionality with toast notifications.",
  "frontend/src/hooks/useVoiceGreeting.ts": "Plays a time-based voice greeting with a soft chime when the vault is unlocked, using speech synthesis with enhanced voice settings for a premium experience.",
  "frontend/src/index.css": "Defines the cyber-tech theme with OKLCH color system, neon glow effects, glass morphism, and custom fonts (Orbitron, Exo 2) for the vault UI.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/shareCrypto.ts": "Provides client-side AES-GCM encryption and decryption functions for secure note sharing using the Web Crypto API, including base64 encoding/decoding utilities for key transport.",
  "frontend/src/utils/shareLink.ts": "Builds share URLs by combining a share ID with a base64-encoded decryption key in the URL hash fragment.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, custom fonts (Orbitron, Exo 2), extended theme tokens for UI components, and animation keyframes for accordions.",
  "project_state.json": "Project metadata for CypherSafe defining implemented features (responsive layout, keyboard shortcuts, desktop install prompt, ICP blockchain sync) and architectural notes about the 1024px breakpoint and focus mode."
}