{
  "backend/main.mo": "Main canister logic defining notes, profiles, share links, authorization checks, and CRUD-style operations backed by in‑canister maps and shared mixins.",
  "backend/migration.mo": "Migration module adding a new shareLinks map to existing actor state by transforming old saved data into the updated structure.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components used, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend files including components, hooks, styling, and routing.",
  "frontend/index.html": "Base HTML file bootstrapping the React application and mounting the root element.",
  "frontend/src/App.tsx": "Top-level React app configuring routing, authentication flow, layouts, secure share-view routes, and initial UI states.",
  "frontend/src/components/DataOwnershipTerms.tsx": "Page component presenting data ownership, privacy, and voice-data handling terms with Cyber‑Tech styled sections.",
  "frontend/src/components/Footer.tsx": "Footer displaying encryption messaging and branding in a themed layout.",
  "frontend/src/components/FullScreenEditorOverlay.tsx": "Full-screen note editor with creation/editing, speech-to-text, animations, and self-destruct settings.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, user menu, and navigation links with Internet Identity integration.",
  "frontend/src/components/LockAnimation.tsx": "Animated lock loading screen cycling through image frames.",
  "frontend/src/components/LoginPrompt.tsx": "Login screen encouraging users to authenticate via Internet Identity with feature highlights.",
  "frontend/src/components/NewNoteOverlay.tsx": "Empty file with no implemented content.",
  "frontend/src/components/NoteEditor.tsx": "Empty file with no implemented content.",
  "frontend/src/components/NotepadPage.tsx": "Empty file with no implemented content.",
  "frontend/src/components/NotesApp.tsx": "Main notes dashboard managing search, note selection, editor overlay, and voice greeting logic.",
  "frontend/src/components/NotesList.tsx": "Scrollable notes list with self-destruct countdowns and selection handling.",
  "frontend/src/components/OurStory.tsx": "Static informational page describing CypherSafe’s mission and background.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a profile setup form where users enter their name and saves it via a mutation. Includes UI elements, validation, and loading state handling.",
  "frontend/src/components/QuickGuide.tsx": "Displays a multi-section guide explaining core app features with icons and navigation back to the notes page. Provides static instructional text grouped by topics like authentication and saving notes.",
  "frontend/src/components/ScanningAnimation.tsx": "Shows a full‑screen animated scanning overlay that fades out shortly after mount. Uses simple state timing to control visibility and transitions.",
  "frontend/src/components/SecureNoteViewPage.tsx": "Fetches an encrypted shared note, extracts a key from the URL, decrypts it client‑side, and displays the result or error states. Handles view-once, expired, and invalid link scenarios with dedicated messaging.",
  "frontend/src/components/Settings.tsx": "Provides a settings page with navigation, user profile loading, and a toggle to mute or enable the AI voice greeting. Also includes a link to data ownership terms and responsive UI elements.",
  "frontend/src/components/ShareLinkDialog.tsx": "Generates encrypted share links for notes using client-side encryption, supports view‑once or timed expiry, and copies the resulting URL to clipboard. Manages UI state for link generation, copying, and error handling.",
  "frontend/src/components/SplashScreen.tsx": "Displays a timed splash screen with a logo and fade‑out zoom animation before calling a completion callback. Uses simple timers to control transition timing.",
  "frontend/src/components/VaultLocked.tsx": "Shows a full‑screen lock screen prompting the user to authenticate via Internet Identity. Includes loading states and animated visuals indicating the vault is locked.",
  "frontend/src/components/WelcomePopup.tsx": "Displays a welcome dialog that marks the popup as seen and closes after confirmation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, stored identity loading, and auth client setup via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, note operations, greeting preferences, and welcome popup state using the backend actor.",
  "frontend/src/hooks/useVoiceGreeting.ts": "Plays a chime and time-based spoken greeting once per session using the Web Speech API unless muted.",
  "frontend/src/index.css": "Establishes global styles and a cyber-tech theme using Tailwind, custom fonts, OKLCH colors, and neon/glass utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/utils/shareCrypto.ts": "Implements AES-GCM encryption/decryption utilities for secure note sharing using Web Crypto API.",
  "frontend/src/utils/shareLink.ts": "Builds a full share URL by combining the app origin, shareId path, and encoded key in the hash fragment.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash/query-based routing params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, animations, and plugins for the frontend theme.",
  "project_state.json": "Project metadata describing secure note‑sharing features, architecture notes, and existing feature definitions."
}