{
  "kind": "build_request",
  "title": "Optimize CypherSafe for Desktop with Responsive Layout and Keyboard Shortcuts",
  "projectName": "CypherSafe",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement responsive side-by-side layout for screens wider than 1024px: left panel displays the notes list, right panel displays the full-screen editor (focus mode)",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "When the screen width is larger than 1024px (PC mode), expand the dashboard into a Side-by-Side Layout. Left Panel: List of your secure notes. Right Panel: The Full-Screen Editor (Focus Mode)."
        ]
      },
      "acceptanceCriteria": [
        "On screens wider than 1024px, NotesApp.tsx displays a two-column layout",
        "Left column shows the NotesList component",
        "Right column shows the FullScreenEditorOverlay component embedded inline (not as an overlay)",
        "Layout remains stacked/single-column on screens 1024px or narrower"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add keyboard shortcut Ctrl+N to create a new note",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Ctrl + N to create a New Crypt."
        ]
      },
      "acceptanceCriteria": [
        "Pressing Ctrl+N anywhere in the app triggers note creation",
        "Shortcut opens the full-screen editor for a new note",
        "Shortcut only activates when user is authenticated"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add keyboard shortcut Ctrl+S to save the current note",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Ctrl + S to Save."
        ]
      },
      "acceptanceCriteria": [
        "Pressing Ctrl+S while editing a note triggers the save mutation",
        "Default browser save behavior is prevented",
        "Visual feedback confirms save action"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add keyboard shortcut Esc to exit focus mode editor",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Esc to exit Focus Mode."
        ]
      },
      "acceptanceCriteria": [
        "Pressing Esc closes the full-screen editor overlay",
        "On desktop (>1024px), Esc clears the selected note and returns to notes list only",
        "Shortcut only works when editor is active"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Display a golden notification prompting desktop users to install CypherSafe with the message: 'Install CypherSafe on your Desktop for a larger writing canvas.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "If the user is on a Desktop browser, show a small golden notification: 'Install CypherSafe on your Desktop for a larger writing canvas.'"
        ]
      },
      "acceptanceCriteria": [
        "Notification appears only on desktop browsers (screen width >1024px)",
        "Notification has a golden/amber visual theme",
        "Notification is dismissible and does not reappear after dismissal",
        "Notification prompts PWA install if supported by browser"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Verify that notes saved on mobile via ICP blockchain are instantly visible on the PC version using the same Internet Identity login",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Ensure that notes saved on the mobile via ICP Blockchain are instantly visible on the PC version using the same login/key."
        ]
      },
      "acceptanceCriteria": [
        "Notes created or updated on one device appear immediately when refreshed on another device",
        "Same Internet Identity principal accesses identical note data on all devices",
        "No device-specific state isolation exists in the backend",
        "React Query cache invalidation ensures fresh data after mutations"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend authentication or note storage logic",
    "Preserve existing mobile-first responsive design for screens ≤1024px",
    "Keep Internet Identity as the sole authentication mechanism",
    "Maintain existing note encryption and self-destruct features"
  ],
  "nonGoals": [
    "Offline editing or local-first sync",
    "Native desktop application distribution",
    "Additional authentication methods beyond Internet Identity",
    "Backend changes to note schema or storage architecture"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}