{
  "kind": "build_request",
  "title": "Add Secure Recovery System with 12-Word Phrase and Master QR Code",
  "projectName": "CypherSafe Recovery System",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate a 12-word mnemonic phrase (BIP39 standard) and corresponding Master QR Code during first-time user setup, after profile creation but before the main vault interface is shown",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "When the user first sets up the app, generate a 'Golden 12-Word Phrase' (Secret Seed) or a Unique Master QR Code"
        ]
      },
      "acceptanceCriteria": [
        "12-word phrase is generated using cryptographically secure randomness",
        "Master QR Code encodes the same 12-word phrase",
        "Generation happens once per user, during initial setup flow",
        "Both phrase and QR code are derived from the same seed"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Design a premium 'Vault Card' component with Black & Gold theme displaying the master key (12-word phrase and QR code), including the security message: 'Your Master Key to the Fortress. Keep it offline. Keep it secret.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Design a beautiful, premium-looking 'Digital Card' in Black & Gold that displays this key. Add the text: 'Your Master Key to the Fortress. Keep it offline. Keep it secret.'"
        ]
      },
      "acceptanceCriteria": [
        "Card uses black background with gold accents matching premium aesthetic",
        "Displays 12-word phrase in readable format (e.g., numbered grid)",
        "Shows QR code prominently on the card",
        "Includes exact security message text",
        "Card design feels elegant and high-security"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Show a security warning dialog before displaying the master key that states: 'This is the only way to recover your data. If lost, even I cannot open your vault.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Before showing the key, the AI should say: 'This is the only way to recover your data. If lost, even I cannot open your vault.'"
        ]
      },
      "acceptanceCriteria": [
        "Warning appears before the Vault Card is revealed",
        "Contains exact warning text provided",
        "User must acknowledge/confirm before proceeding",
        "Warning emphasizes the critical importance of the key"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add 'Scan to Sync' option on the login screen allowing users to restore their vault by either scanning the Master QR Code or manually entering the 12-word phrase",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "On a new PC or phone, add a 'Scan to Sync' option on the login screen. The user can either scan the QR from their old phone or type the 12 words to instantly restore all blockchain notes"
        ]
      },
      "acceptanceCriteria": [
        "Login screen includes 'Scan to Sync' button/option",
        "QR scanner interface allows camera-based scanning",
        "Manual entry option accepts 12-word phrase input",
        "Both methods restore full vault access when valid key is provided",
        "Invalid keys show clear error messages"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement export functionality allowing users to save the Master Key as a password-protected PDF or high-resolution printable image",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Allow the user to save this Master Key as a Password-Protected PDF or a high-resolution image to print and keep in a physical safe"
        ]
      },
      "acceptanceCriteria": [
        "PDF export includes the Vault Card design with 12-word phrase and QR code",
        "PDF is password-protected with user-chosen password",
        "High-resolution image export (300 DPI or higher) suitable for printing",
        "Both export formats maintain the Black & Gold premium design",
        "Exports are initiated from the Vault Card interface"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Store the 12-word phrase securely in the backend associated with the user's Principal identity to enable recovery verification and vault restoration",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "12-word phrase is stored encrypted or hashed in backend",
        "Backend validates provided recovery phrase during restoration",
        "Recovery phrase is linked to user's Principal for verification",
        "Backend supports querying whether a recovery phrase exists for current user"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Integrate the master key display into the onboarding flow after ProfileSetup completion, showing the security warning followed by the Vault Card with export options",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "Key display occurs after profile setup is complete",
        "Flow progresses: Profile Setup → Security Warning → Vault Card → Main Vault",
        "User cannot skip viewing the master key during initial setup",
        "After initial setup, key can be accessed from Settings for export"
      ]
    }
  ],
  "constraints": [
    "Must use Motoko for all backend cryptographic operations and storage",
    "Cannot use external authentication services; Internet Identity is the only supported auth",
    "Recovery system must work entirely within ICP blockchain infrastructure",
    "QR scanning must use browser APIs or React-compatible libraries, no native mobile features"
  ],
  "nonGoals": [
    "Biometric authentication integration",
    "SMS or email-based recovery",
    "Multi-signature recovery workflows",
    "Hardware security key integration beyond Internet Identity",
    "Cloud backup services for recovery phrases"
  ],
  "imageRequirements": {
    "required": [
      "Premium Black & Gold fortress lock icon for Vault Card header (vault-card-lock.dim_128x128.png)"
    ],
    "edits": []
  }
}