{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Secure Recovery System with 12-Word Phrase and Master QR Code",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Generate a 12-word mnemonic phrase (BIP39 standard) and corresponding Master QR Code during first-time user setup",
      "acceptanceCriteria": [
        "12-word phrase is generated using cryptographically secure randomness",
        "Master QR Code encodes the same 12-word phrase",
        "Generation happens once per user, during initial setup flow",
        "Both phrase and QR code are derived from the same seed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/mnemonicGenerator.ts",
          "operation": "create",
          "description": "Create utility module for generating BIP39-compliant 12-word mnemonic phrases using the Web Crypto API for cryptographically secure randomness. Include functions to generate mnemonic, convert to QR-compatible format, and validate phrase format. Do not implement backend storage here."
        },
        {
          "path": "frontend/src/utils/qrCodeGenerator.ts",
          "operation": "create",
          "description": "Create utility module for generating QR codes from mnemonic phrases using a QR code generation library (e.g., qrcode or qrcode.react). Include functions to generate QR code data URL from text and configure error correction level for premium quality output."
        },
        {
          "path": "frontend/src/hooks/useRecoveryGeneration.ts",
          "operation": "create",
          "description": "Create React hook that orchestrates recovery phrase generation during first-time setup. Hook should check if user already has recovery data via backend query, generate new phrase if needed, call backend to store the phrase, and return generated phrase, QR code data URL, and loading/error states. Use useQuery and useMutation from React Query."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Design a premium 'Vault Card' component with Black & Gold theme displaying the master key (12-word phrase and QR code)",
      "acceptanceCriteria": [
        "Card uses black background with gold accents matching premium aesthetic",
        "Displays 12-word phrase in readable format (e.g., numbered grid)",
        "Shows QR code prominently on the card",
        "Includes exact security message text",
        "Card design feels elegant and high-security"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VaultCard.tsx",
          "operation": "create",
          "description": "Create premium Vault Card component with Black & Gold theme using Cyber-Tech styling from existing index.css. Display 12-word mnemonic in a numbered 3x4 or 4x3 grid format with clear numbering (1-12), render QR code image using data URL, display the exact security message 'Your Master Key to the Fortress. Keep it offline. Keep it secret.' Include the generated vault-card-lock.dim_128x128.png icon at the card header using workspace path frontend/public/assets/generated/vault-card-lock.dim_128x128.png. Use glass morphism effects, neon borders, and gold accents consistent with existing UI theme. Accept props for mnemonic phrase and QR code data URL."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show a security warning dialog before displaying the master key",
      "acceptanceCriteria": [
        "Warning appears before the Vault Card is revealed",
        "Contains exact warning text provided",
        "User must acknowledge/confirm before proceeding",
        "Warning emphasizes the critical importance of the key"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RecoveryWarningDialog.tsx",
          "operation": "create",
          "description": "Create modal dialog component using shadcn/ui Dialog that displays the exact security warning text: 'This is the only way to recover your data. If lost, even I cannot open your vault.' Use Cyber-Tech styling with high-contrast warning colors (gold/red accents). Include prominent 'I Understand' confirmation button that must be clicked to proceed to Vault Card display. Dialog should be dismissible only via the confirmation button, not by clicking outside or pressing Escape."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add 'Scan to Sync' option on the login screen allowing users to restore their vault by scanning QR Code or entering 12-word phrase",
      "acceptanceCriteria": [
        "Login screen includes 'Scan to Sync' button/option",
        "QR scanner interface allows camera-based scanning",
        "Manual entry option accepts 12-word phrase input",
        "Both methods restore full vault access when valid key is provided",
        "Invalid keys show clear error messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RecoveryRestoreDialog.tsx",
          "operation": "create",
          "description": "Create modal dialog component for vault restoration with two tabs/modes: 'Scan QR Code' and 'Enter Phrase'. For QR scanning, use the qr-code/useQRScanner hook (verify the component's usage instructions before implementing). Display camera preview, handle scanned QR results, and extract mnemonic phrase from QR data. For manual entry, provide a form with 12 input fields (one per word) with validation. Call backend to verify the recovery phrase via retrievePersistentRecoveryPhrase and compare. On successful match, trigger re-authentication flow. Show error messages for invalid phrases or backend verification failures. Use Cyber-Tech styling consistent with existing components."
        },
        {
          "path": "frontend/src/components/LoginPrompt.tsx",
          "operation": "modify",
          "description": "Add 'Scan to Sync' button to the LoginPrompt component below the main Internet Identity login button. Button should open the RecoveryRestoreDialog component. Style button with secondary styling (gold outline) to distinguish from primary login action. Include brief descriptive text like 'Restore vault from recovery key'."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement export functionality allowing users to save the Master Key as password-protected PDF or high-resolution printable image",
      "acceptanceCriteria": [
        "PDF export includes the Vault Card design with 12-word phrase and QR code",
        "PDF is password-protected with user-chosen password",
        "High-resolution image export (300 DPI or higher) suitable for printing",
        "Both export formats maintain the Black & Gold premium design",
        "Exports are initiated from the Vault Card interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/vaultCardExport.ts",
          "operation": "create",
          "description": "Create utility module for exporting Vault Card as PDF or image. For PDF export, use a library like jsPDF to render the card design with mnemonic and QR code, then apply password protection using pdf-lib or similar. For image export, use html2canvas or similar to capture the VaultCard component at high resolution (300 DPI equivalent, approximately 3000x2000 pixels for 10x6.67 inch card). Include functions: exportAsPDF(mnemonic, qrDataUrl, password), exportAsImage(mnemonic, qrDataUrl). Return downloadable File or Blob objects."
        },
        {
          "path": "frontend/src/components/VaultCardExportDialog.tsx",
          "operation": "create",
          "description": "Create modal dialog component for initiating Vault Card exports. Provide two export options: 'Export as Password-Protected PDF' and 'Export as High-Resolution Image'. For PDF export, include a password input field with confirmation. On export, call vaultCardExport utility functions and trigger browser download. Show loading state during export generation. Use Cyber-Tech styling and shadcn/ui Dialog component. Accept mnemonic phrase and QR code data URL as props."
        },
        {
          "path": "frontend/src/components/VaultCard.tsx",
          "operation": "modify",
          "description": "Add 'Export' button to the VaultCard component footer that opens the VaultCardExportDialog. Style button with gold accent consistent with theme. Position button prominently below the security message."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Integrate the master key display into the onboarding flow after ProfileSetup completion",
      "acceptanceCriteria": [
        "Key display occurs after profile setup is complete",
        "Flow progresses: Profile Setup → Security Warning → Vault Card → Main Vault",
        "User cannot skip viewing the master key during initial setup",
        "After initial setup, key can be accessed from Settings for export"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RecoverySetupFlow.tsx",
          "operation": "create",
          "description": "Create orchestration component that manages the recovery setup flow for first-time users. Use useRecoveryGeneration hook to generate or retrieve recovery data. Render RecoveryWarningDialog first, then VaultCard with export options after user confirms warning. Track flow state (warning → card display → completion) using local state. On completion, mark recovery setup as complete in user profile and proceed to main vault. Component should only render for first-time users who have completed profile setup but have not yet seen their recovery key."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate RecoverySetupFlow into the authentication orchestration between ProfileSetup and WelcomePopup. Add conditional rendering: if user is authenticated, has profile, but has not completed recovery setup (check via user profile flag or recovery data existence query), show RecoverySetupFlow before proceeding to main vault. Ensure recovery setup is mandatory during first-time onboarding but skipped for returning users."
        },
        {
          "path": "frontend/src/components/Settings.tsx",
          "operation": "modify",
          "description": "Add 'View & Export Recovery Key' option to the Settings page for authenticated users. When clicked, fetch user's recovery phrase from backend via retrievePersistentRecoveryPhrase, regenerate QR code, and display VaultCard with export options in a full-screen overlay or modal. Include security warning before displaying. This allows returning users to access their recovery key after initial setup."
        }
      ]
    }
  ]
}