{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optimize CypherSafe for Desktop with Responsive Layout and Keyboard Shortcuts",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement responsive side-by-side layout for screens wider than 1024px with notes list on left and full-screen editor on right",
      "acceptanceCriteria": [
        "On screens wider than 1024px, NotesApp.tsx displays a two-column layout",
        "Left column shows the NotesList component",
        "Right column shows the FullScreenEditorOverlay component embedded inline (not as an overlay)",
        "Layout remains stacked/single-column on screens 1024px or narrower"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NotesApp.tsx",
          "operation": "modify",
          "description": "Add responsive layout logic: wrap the component in a container that displays as a two-column grid on screens >1024px using Tailwind breakpoints (lg:grid lg:grid-cols-2). On desktop, embed FullScreenEditorOverlay inline in the right column instead of rendering it as a fixed overlay. On mobile (≤1024px), maintain the existing stacked layout with the overlay behavior. Ensure selectedNote state properly controls which note is displayed in the right panel."
        },
        {
          "path": "frontend/src/components/FullScreenEditorOverlay.tsx",
          "operation": "modify",
          "description": "Add a prop to control whether the editor renders as an overlay (mobile) or inline panel (desktop). When inline mode is active (>1024px), remove fixed positioning and overlay backdrop, and render as a standard scrollable panel. Preserve all existing editor functionality including speech-to-text, animations, and self-destruct settings regardless of display mode."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add keyboard shortcut Ctrl+N to create a new note",
      "acceptanceCriteria": [
        "Pressing Ctrl+N anywhere in the app triggers note creation",
        "Shortcut opens the full-screen editor for a new note",
        "Shortcut only activates when user is authenticated"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useKeyboardShortcuts.ts",
          "operation": "create",
          "description": "Create a custom hook that listens for keyboard shortcuts using useEffect with document event listeners. Support Ctrl+N (create new note), Ctrl+S (save note), and Esc (exit editor). Accept callback props for each shortcut action. Prevent default browser behavior for Ctrl+S. Only activate shortcuts when user is authenticated (check via useInternetIdentity)."
        },
        {
          "path": "frontend/src/components/NotesApp.tsx",
          "operation": "modify",
          "description": "Import and use the useKeyboardShortcuts hook. Wire Ctrl+N to trigger the same logic as the create note button (set selectedNote to null and open editor). Ensure the shortcut only works when the user is authenticated."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add keyboard shortcut Ctrl+S to save the current note",
      "acceptanceCriteria": [
        "Pressing Ctrl+S while editing a note triggers the save mutation",
        "Default browser save behavior is prevented",
        "Visual feedback confirms save action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FullScreenEditorOverlay.tsx",
          "operation": "modify",
          "description": "Import and use the useKeyboardShortcuts hook (created in REQ-2). Wire Ctrl+S to trigger the handleSave function that already exists in this component. Ensure preventDefault is called to block browser save dialog. Add visual feedback (e.g., brief success message or animation) when save completes."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add keyboard shortcut Esc to exit focus mode editor",
      "acceptanceCriteria": [
        "Pressing Esc closes the full-screen editor overlay",
        "On desktop (>1024px), Esc clears the selected note and returns to notes list only",
        "Shortcut only works when editor is active"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FullScreenEditorOverlay.tsx",
          "operation": "modify",
          "description": "Use the useKeyboardShortcuts hook (created in REQ-2) to listen for Esc key. Wire Esc to trigger the onClose callback that already exists in this component. Ensure the shortcut only fires when the editor is active/visible. On desktop layout (>1024px), Esc should clear selectedNote and return focus to the notes list."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Display a golden notification prompting desktop users to install CypherSafe as a PWA",
      "acceptanceCriteria": [
        "Notification appears only on desktop browsers (screen width >1024px)",
        "Notification has a golden/amber visual theme",
        "Notification is dismissible and does not reappear after dismissal",
        "Notification prompts PWA install if supported by browser"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstallPrompt.tsx",
          "operation": "create",
          "description": "Create a component that displays a golden/amber themed notification with the message: 'Install CypherSafe on your Desktop for a larger writing canvas.' Show the notification only when screen width >1024px (use window.matchMedia or Tailwind breakpoints). Store dismissal state in localStorage to prevent repeated display. If the browser supports PWA installation (beforeinstallprompt event), include an install button that triggers the native prompt. Otherwise, show a generic install message. Style with golden/amber colors matching the app's cyber-tech theme from frontend/src/index.css."
        },
        {
          "path": "frontend/src/components/NotesApp.tsx",
          "operation": "modify",
          "description": "Import and render the InstallPrompt component near the top of the notes dashboard. Position it so it's visible but not intrusive (e.g., as a banner below the header or as a dismissible toast notification)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Verify that notes saved on mobile are instantly visible on desktop using the same Internet Identity login",
      "acceptanceCriteria": [
        "Notes created or updated on one device appear immediately when refreshed on another device",
        "Same Internet Identity principal accesses identical note data on all devices",
        "No device-specific state isolation exists in the backend",
        "React Query cache invalidation ensures fresh data after mutations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and ensure that all note mutations (create, update, delete) properly invalidate the React Query cache for note lists and individual notes. Verify that the queryKey structure is consistent and that invalidateQueries is called after every mutation. Ensure no device-specific caching logic exists that would prevent cross-device synchronization. Add refetchOnWindowFocus: true to note list queries if not already present, so switching back to the app refetches data."
        }
      ]
    }
  ]
}